app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.paginate(page: params[:page])

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test the user id"], ["body", "test nine"], ["user_id", 1], ["created_at", "2020-02-18 16:49:37.599588"], ["updated_at", "2020-02-18 16:49:37.599588"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save